#Дано: текст любой длины.
#Задание: написать программу, которая выведет заголовок, используя заданный текст. Подсказка используйте метод title.
#Пример: text = 'hello world'; результат = Hello World
print('Задание 3')
print('Enter a phrase for the title:')
phrase= str(input())

print('Title:', phrase.title())